modules/admin/controllers/DashboardController.php

SELECT SUM(admin_commission_amount) FROM `vendor_earnings` WHERE (`status`=1) AND (`created_on` BETWEEN '2025-11-07 00:00:00' AND '2025-11-07 12:13:30')
SELECT SUM(admin_commission_amount) FROM `vendor_earnings` WHERE (`status`=1) AND (`created_on` BETWEEN '2025-10-31 00:00:00' AND '2025-11-07 12:13:30')
SELECT SUM(admin_commission_amount) FROM `vendor_earnings` WHERE (`status`=1) AND (`created_on` BETWEEN '2025-10-08 00:00:00' AND '2025-11-07 12:13:30')
SELECT COUNT(*) FROM `orders` WHERE `status`=1
SELECT COUNT(*) FROM `orders` WHERE `status`=2
SELECT COUNT(*) FROM `orders` WHERE `status`=3
SELECT COUNT(*) FROM `orders` WHERE `status`=4
SELECT COUNT(*) FROM `orders` WHERE `status` IN (6, 7, 8, 10, 11)
SELECT COUNT(*) FROM `vendor_details` WHERE `status`=1
SELECT COUNT(*) FROM `vendor_details` WHERE `status`=3
SELECT COUNT(*) FROM `vendor_details` WHERE (`status`=1) OR (`status`=3)
SELECT COUNT(*) FROM `user` WHERE (`status`=10) AND (`user_role` IN ('user', 'home_visitor', 'staff', 'vendor'))
SELECT COUNT(*) FROM `user` WHERE (`status`=10) AND (`user_role`='user')
---
    }

    if (!User::isVendor()) {
        $data['admin_commission_day'] = VendorEarnings::find()
            ->where(['status' => VendorEarnings::STATUS_APPROVED])
            ->andWhere(['between', 'created_on', $toDayDate, $toDayDateTileTime])
            ->sum('admin_commission_amount');

        $data['admin_commission_week'] = VendorEarnings::find()
            ->where(['status' => VendorEarnings::STATUS_APPROVED])
            ->andWhere(['between', 'created_on', $last7Days, $toDayDateTileTime])
            ->sum('admin_commission_amount');

        $data['admin_commission_month'] = VendorEarnings::find()
            ->where(['status' => VendorEarnings::STATUS_APPROVED])
            ->andWhere(['between', 'created_on', $last30Days, $toDayDateTileTime])
            ->sum('admin_commission_amount');

        $data['new_orders'] = Orders::find()->where(['status' => Orders::STATUS_NEW_ORDER])->count();
        $data['accepted_orders'] = Orders::find()->where(['status' => Orders::STATUS_ACCEPTED])->count();
        $data['ongoing_orders'] = Orders::find()->where(['status' => Orders::STATUS_SERVICE_STARTED])->count();
        $data['completed_orders'] = Orders::find()->where(['status' => Orders::STATUS_SERVICE_COMPLETED])->count();

        // Admin view also updated to include all cancellation statuses
        $data['cancelled_orders'] = Orders::find()
            ->where(['in', 'status', [
                Orders::STATUS_CANCELLED_BY_OWNER,
                Orders::STATUS_CANCELLED_BY_USER,
                Orders::STATUS_CANCELLED_BY_ADMIN,
                Orders::STATUS_CANCELLED_BY_HOME_VISITORS,
                Orders::STATUS_CANCELLED
            ]])
            ->count();
    }
    // Common data for all users
    $data['active_vendors'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_ACTIVE])->count();
    $data['pending_onboarding'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_VERIFICATION_PENDING])->count();
    $data['total_vendors'] = VendorDetails::find()
        ->where(['status' => VendorDetails::STATUS_ACTIVE])
        ->orWhere(['status' => VendorDetails::STATUS_VERIFICATION_PENDING])
        ->count();

    $data['total_users'] = User::find()
        ->where(['status' => User::STATUS_ACTIVE])
        ->andWhere(['user_role' => [User::ROLE_USER, User::ROLE_HOME_VISITOR, User::ROLE_STAFF, User::ROLE_VENDOR]])
        ->count();

    $data['only_users'] = User::find()
        ->where(['status' => User::STATUS_ACTIVE, 'user_role' => User::ROLE_USER])
        ->count();

SELECT COUNT(*) FROM `staff` WHERE (`status`=1) AND (`role`='home_visitor')
SELECT COUNT(*) FROM `staff` WHERE (`status`=1) AND (`role`='staff')
---
            $data['total_staff'] = 0;
        }
    } else {
        $data['total_homevisitors'] = Staff::find()
            ->where(['status' => Staff::STATUS_ACTIVE, 'role' => Staff::ROLE_HOME_VISITOR])
            ->count();

        $data['total_staff'] = Staff::find()
            ->where(['status' => Staff::STATUS_ACTIVE, 'role' => Staff::ROLE_STAFF])
            ->count();

SELECT COUNT(*) FROM `vendor_details` WHERE `status`=1
SELECT COUNT(*) FROM `vendor_details` WHERE (`status`=1) AND (`main_category_id`=1)
SELECT COUNT(*) FROM `vendor_details` WHERE (`status`=1) AND (`main_category_id`=2)
SELECT COUNT(*) FROM `vendor_details` WHERE (`status`=1) AND (`main_category_id`=3)
SELECT COUNT(*) FROM `subscriptions` WHERE `status`=1
SELECT COUNT(*) FROM `subscriptions` WHERE (`subscription_type`=1) AND (`status`=1)
SELECT COUNT(*) FROM `subscriptions` WHERE (`subscription_type`=2) AND (`status`=1)
---

    $data['total_staff_home'] = $data['total_homevisitors'] + $data['total_staff'];

    $data['total_shops'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_ACTIVE])->count();
    $data['total_spa'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_ACTIVE, 'main_category_id' => 1])->count();
    $data['total_saloon'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_ACTIVE, 'main_category_id' => 2])->count();
    $data['total_skin'] = VendorDetails::find()->where(['status' => VendorDetails::STATUS_ACTIVE, 'main_category_id' => 3])->count();

    $data['total_subscriptions'] = Subscriptions::find()->where(['status' => Subscriptions::STATUS_ACTIVE])->count();
    $data['basic_subscriptions'] = Subscriptions::find()->where(['subscription_type' => Subscriptions::SUBSCRIPTION_TYPE_IS_BASIC, 'status' => Subscriptions::STATUS_ACTIVE])->count();
    $data['premium_subscriptions'] = Subscriptions::find()->where(['subscription_type' => Subscriptions::SUBSCRIPTION_TYPE_IS_PREMIUM, 'status' => Subscriptions::STATUS_ACTIVE])->count();