modules/admin/controllers/UsersController.php

    public function actionVendorView($id)
    {

        $model = User::findOne(['id' => $id]);
---
SELECT * FROM `user` WHERE `id`='2151'

public function actionCreateVendor()
{
    $model           = new User();
    $model->scenario = 'create_vendor';
    $model->status   = User::STATUS_ACTIVE;

    // AJAX validation
    if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())) {
        Yii::$app->response->format = Response::FORMAT_JSON;
        return \yii\widgets\ActiveForm::validate($model);
    }

    if ($model->load(Yii::$app->request->post())) {
        // Force vendor role
        $model->user_role = User::ROLE_VENDOR;

        // Normalize inputs
        $username   = trim((string) $model->username);
        $contact_no = preg_replace('/\s+/', '', trim((string) $model->contact_no));
        $email      = trim((string) $model->email);

        // ✅ Capture allow_order_approval toggle (from form)
        $allowOrderApproval = Yii::$app->request->post('User')['allow_order_approval'] ?? 0;
        $model->allow_order_approval = $allowOrderApproval ? 1 : 0;

        // ✅ Check role + contact_no validation
        if (!empty($contact_no)) {
            $existingVendor = User::find()
                ->where([
                    'user_role'  => User::ROLE_VENDOR,
                    'contact_no' => $contact_no,
                ])
                ->one();
---
SELECT * FROM `user` WHERE (`user_role`='vendor') AND (`contact_no`='1100110011')