modules/admin/views/partials/header.php

SELECT COUNT(*) FROM `notification` WHERE (`mark_read`=0) AND (`order_id` IS NULL)
SELECT COUNT(*) FROM `notification` WHERE (`mark_read`=0) AND (`order_id` IS NOT NULL)
---
                        $notifications = [];

                        if (User::isAdmin()) {
                            $generalCount = Notification::find()
                                ->where(['mark_read' => 0])
                                ->andWhere(['order_id' => null])
                                ->count();

                            $orderCount = Notification::find()
                                ->where(['mark_read' => 0])
                                ->andWhere(['IS NOT', 'order_id', null])
                                ->count();