modules/admin/views/users/index.php

SELECT * FROM `user` WHERE `user_role`='user' ORDER BY `id`
---
                return $model->username;
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => ArrayHelper::map(
           User::find()
                ->where(['user_role' => $role])
                ->orderBy('id')->asArray()->all(),
            'username', 'username'
        ),