modules/admin/views/users/index_vendor.php

SELECT * FROM `user` WHERE `user_role`='vendor' ORDER BY `id`
---
                    return $model->username;
                },
                'filterType'          => GridView::FILTER_SELECT2,
                'filter'              => ArrayHelper::map(
                    User::find()
                        ->where(['user_role' => 'vendor'])
                        ->orderBy('id')->asArray()->all(),
                    'username', 'username'
                ),