modules/admin/views/users/vendor_view.php

                        [
                            'label' => 'email',
                            'value' => function ($model) {
                                $vendor = User::find()->where(['id' => $model->id])->one();
---
SELECT * FROM `user` WHERE `id`=2151

                        [
                            'label' => 'contact_no',
                            'value' => function ($model) {
                                $vendor = User::find()->where(['id' => $model->id])->one();
---
SELECT * FROM `user` WHERE `id`=2151